
//==========================================================================================================================
bool bRoot = false;


HMODULE dllHandle;

UINT Stride;

//elementcount
D3DVERTEXELEMENT9 decl[MAXD3DDECLLENGTH];
UINT numElements;

//vertexshader
IDirect3DVertexShader9* vShader;
UINT vSize;

//pixelshader
IDirect3DPixelShader9* pShader;
UINT pSize;

//startregister vector4fcount
UINT mStartRegister;
UINT mVector4fCount;

int globaltid = 1;

bool FirstInit = false; //init once
bool bXrayHooked = false;
bool bSwap = false;
bool bSpritesCreated = false;
bool bScoreSaved = false;
int  iSavedScoreTT = 0;
int  iSavedScoreCT = 0;

// 4:3
int HPBarPosY = 250;
int ICCLogoXPos = 5;
int ICCLogoYPos = 45;
int bar_width = 230;

int iSavedPlayersScore[32];
int iSavedPlayersDeaths[32];

int iPlayersScore[32] = { 0 };
int iPlayersDeaths[32] = { 0 };

int iShowDMGDealt = 0;
int iDmgDealtCurrent[32] = { 0 };
int iDmgDealtLast[32] = { 0 };
int iDmgDealtTotal[32] = { 0 };
int iDmgDealtTotalSaved[32] = { 0 };

string team1;
string team2;
int iBorderedText = 0;
int iTransparency = 0;
int iAutoUpdateScore = 0;
int iPatternScan = 0;
int mr = 15;

bool bNewRound = false;
bool bNoFow = false;
bool bNoFlash = false;
bool bXray = false;
bool bSpecmode = 0;

char * bytesNoFow;
int OldSpecmode = -1;

int scoreTT = 0;
int baseScoreTT = 0;

int scoreCT = 0;
int baseScoreCT = 0;

// Mid HOOK 
DWORD HitFuncjmpBack;
DWORD Hooking_AddrLocalBack;
DWORD Hooking_AddrNadeBack;

BYTE weapon_fnf2000[] = { 0x42, 0x4D, 0x30, 0x3, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x36, 0x0, 0x0, 0x0, 0x28, 0x0, 0x0, 0x0, 0x19, 0x0, 0x0, 0x0, 0xA, 0x0, 0x0, 0x0, 0x1, 0x0, 0x18, 0x0, 0x0, 0x0, 0x0, 0x0, 0xFA, 0x2, 0x0, 0x0, 0xC0, 0x1E, 0x0, 0x0, 0xC0, 0x1E, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x15, 0x15, 0x15, 0xA8, 0xA8, 0xA8, 0xE2, 0xE2, 0xE2, 0x9E, 0x9E, 0x9E, 0x4C, 0x4C, 0x4C, 0x31, 0x31, 0x31, 0x0, 0x0, 0x0, 0x57, 0x57, 0x57, 0xF0, 0xF0, 0xF0, 0xEA, 0xEA, 0xEA, 0x36, 0x36, 0x36, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x29, 0x29, 0x29, 0x93, 0x93, 0x93, 0x95, 0x95, 0x95, 0x95, 0x95, 0x95, 0x87, 0x87, 0x87, 0x55, 0x55, 0x55, 0xEC, 0xEC, 0xEC, 0xAA, 0xAA, 0xAA, 0xEF, 0xEF, 0xEF, 0xEB, 0xEB, 0xEB, 0xD8, 0xD8, 0xD8, 0x3B, 0x3B, 0x3B, 0xCF, 0xCF, 0xCF, 0xDA, 0xDA, 0xDA, 0xEC, 0xEC, 0xEC, 0xE5, 0xE5, 0xE5, 0x3C, 0x3C, 0x3C, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x42, 0x42, 0x42, 0xFF, 0xFF, 0xFF, 0xF7, 0xF7, 0xF7, 0xF9, 0xF9, 0xF9, 0xEF, 0xEF, 0xEF, 0xDC, 0xDC, 0xDC, 0xF3, 0xF3, 0xF3, 0xED, 0xED, 0xED, 0xDC, 0xDC, 0xDC, 0xC4, 0xC4, 0xC4, 0xDC, 0xDC, 0xDC, 0xDC, 0xDC, 0xDC, 0xF3, 0xF3, 0xF3, 0xFA, 0xFA, 0xFA, 0x94, 0x94, 0x94, 0xCD, 0xCD, 0xCD, 0xF2, 0xF2, 0xF2, 0xD3, 0xD3, 0xD3, 0xDA, 0xDA, 0xDA, 0xD5, 0xD5, 0xD5, 0x31, 0x31, 0x31, 0x2B, 0x2B, 0x2B, 0x29, 0x29, 0x29, 0x26, 0x26, 0x26, 0xA, 0xA, 0xA, 0x0, 0x98, 0x98, 0x98, 0xE3, 0xE3, 0xE3, 0xB7, 0xB7, 0xB7, 0xB7, 0xB7, 0xB7, 0xB4, 0xB4, 0xB4, 0xBD, 0xBD, 0xBD, 0xC0, 0xC0, 0xC0, 0xB3, 0xB3, 0xB3, 0xCB, 0xCB, 0xCB, 0x9B, 0x9B, 0x9B, 0x96, 0x96, 0x96, 0xCD, 0xCD, 0xCD, 0xDF, 0xDF, 0xDF, 0xF0, 0xF0, 0xF0, 0x9A, 0x9A, 0x9A, 0xC5, 0xC5, 0xC5, 0xCA, 0xCA, 0xCA, 0xE5, 0xE5, 0xE5, 0xCC, 0xCC, 0xCC, 0xFC, 0xFC, 0xFC, 0xE3, 0xE3, 0xE3, 0xDC, 0xDC, 0xDC, 0xEC, 0xEC, 0xEC, 0xFF, 0xFF, 0xFF, 0x4C, 0x4C, 0x4C, 0x0, 0xFF, 0xFF, 0xFF, 0xF4, 0xF4, 0xF4, 0xEC, 0xEC, 0xEC, 0xEC, 0xEC, 0xEC, 0xEC, 0xEC, 0xEC, 0xED, 0xED, 0xED, 0xEF, 0xEF, 0xEF, 0xEB, 0xEB, 0xEB, 0xFF, 0xFF, 0xFF, 0xB6, 0xB6, 0xB6, 0xBB, 0xBB, 0xBB, 0xF8, 0xF8, 0xF8, 0xE7, 0xE7, 0xE7, 0xF2, 0xF2, 0xF2, 0xB4, 0xB4, 0xB4, 0xF1, 0xF1, 0xF1, 0xDC, 0xDC, 0xDC, 0xF2, 0xF2, 0xF2, 0xDF, 0xDF, 0xDF, 0xF2, 0xF2, 0xF2, 0xE5, 0xE5, 0xE5, 0xE5, 0xE5, 0xE5, 0xEB, 0xEB, 0xEB, 0xE8, 0xE8, 0xE8, 0x46, 0x46, 0x46, 0x0, 0xF7, 0xF7, 0xF7, 0xDA, 0xDA, 0xDA, 0xD8, 0xD8, 0xD8, 0xD5, 0xD5, 0xD5, 0xD4, 0xD4, 0xD4, 0xD1, 0xD1, 0xD1, 0xCF, 0xCF, 0xCF, 0xCF, 0xCF, 0xCF, 0xCA, 0xCA, 0xCA, 0xBE, 0xBE, 0xBE, 0xD4, 0xD4, 0xD4, 0xCA, 0xCA, 0xCA, 0xCA, 0xCA, 0xCA, 0xC9, 0xC9, 0xC9, 0xCD, 0xCD, 0xCD, 0xBF, 0xBF, 0xBF, 0xCD, 0xCD, 0xCD, 0xBF, 0xBF, 0xBF, 0xAF, 0xAF, 0xAF, 0xAD, 0xAD, 0xAD, 0xBE, 0xBE, 0xBE, 0xD5, 0xD5, 0xD5, 0xD6, 0xD6, 0xD6, 0x35, 0x35, 0x35, 0x2, 0x2, 0x2, 0x0, 0xFC, 0xFC, 0xFC, 0xD6, 0xD6, 0xD6, 0xD3, 0xD3, 0xD3, 0xCF, 0xCF, 0xCF, 0xCD, 0xCD, 0xCD, 0xCC, 0xCC, 0xCC, 0xC8, 0xC8, 0xC8, 0xC2, 0xC2, 0xC2, 0xBA, 0xBA, 0xBA, 0xBC, 0xBC, 0xBC, 0xB1, 0xB1, 0xB1, 0xCD, 0xCD, 0xCD, 0xE5, 0xE5, 0xE5, 0xE5, 0xE5, 0xE5, 0xE3, 0xE3, 0xE3, 0xEA, 0xEA, 0xEA, 0xDE, 0xDE, 0xDE, 0xF1, 0xF1, 0xF1, 0xAB, 0xAB, 0xAB, 0xAD, 0xAD, 0xAD, 0xD6, 0xD6, 0xD6, 0xD1, 0xD1, 0xD1, 0xEB, 0xEB, 0xEB, 0xA0, 0xA0, 0xA0, 0x0, 0x0, 0x0, 0x0, 0xD9, 0xD9, 0xD9, 0xD4, 0xD4, 0xD4, 0xD3, 0xD3, 0xD3, 0xD3, 0xD3, 0xD3, 0xD3, 0xD3, 0xD3, 0xD3, 0xD3, 0xD3, 0xD3, 0xD3, 0xD3, 0xEE, 0xEE, 0xEE, 0xF9, 0xF9, 0xF9, 0xC8, 0xC8, 0xC8, 0xB2, 0xB2, 0xB2, 0xBA, 0xBA, 0xBA, 0xC1, 0xC1, 0xC1, 0xBE, 0xBE, 0xBE, 0xBB, 0xBB, 0xBB, 0xC8, 0xC8, 0xC8, 0xDF, 0xDF, 0xDF, 0xD3, 0xD3, 0xD3, 0xD6, 0xD6, 0xD6, 0xD5, 0xD5, 0xD5, 0xAD, 0xAD, 0xAD, 0x2D, 0x2D, 0x2D, 0x29, 0x29, 0x29, 0x15, 0x15, 0x15, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x48, 0x48, 0x48, 0xBA, 0xBA, 0xBA, 0xD8, 0xD8, 0xD8, 0xA2, 0xA2, 0xA2, 0xA4, 0xA4, 0xA4, 0xA0, 0xA0, 0xA0, 0x9A, 0x9A, 0x9A, 0x97, 0x97, 0x97, 0x97, 0x97, 0x97, 0x9E, 0x9E, 0x9E, 0xEE, 0xEE, 0xEE, 0x96, 0x96, 0x96, 0x8F, 0x8F, 0x8F, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x17, 0x17, 0x17, 0xC3, 0xC3, 0xC3, 0xE3, 0xE3, 0xE3, 0xE3, 0xE3, 0xE3, 0xE1, 0xE1, 0xE1, 0xE1, 0xE1, 0xE1, 0xE1, 0xE1, 0xE1, 0xE4, 0xE4, 0xE4, 0xEC, 0xEC, 0xEC, 0x52, 0x52, 0x52, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0 };

//=====================================================================================================================
// Generated using ReClass 2016

class CPlayer;
class CName;
class CWeapon;

void TextWithBorder(LPD3DXFONT, int, int, DWORD, char*, DWORD);
void DrawICCLogo(LPDIRECT3DDEVICE9, int, int);

BYTE *byteWeapons[92] = { NULL, weapon_usp , weapon_glock, weapon_deagle, weapon_p228, weapon_elite, weapon_fiveseven, NULL, NULL, NULL, weapon_m3, weapon_xm1014, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, weapon_mp5, weapon_tmp, weapon_p90, weapon_mac10, weapon_ump, NULL, NULL, NULL, NULL, NULL, weapon_ak47, weapon_sg552, weapon_m4a1, weapon_aug, weapon_scout, weapon_awp, weapon_g3sg1, weapon_sg550, weapon_galil, weapon_famas, weapon_m249, weapon_tacticalshield, NULL, NULL, NULL, weapon_laser, weapon_flamethrower, weapon_rpglauncher, weapon_rocketlauncher, weapon_grenadelauncher, weapon_knife, weapon_HE, weapon_flash, weapon_smoke, weapon_flare, weapon_bomb, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, weapon_machete, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, weapon_m134, weapon_fnf2000};

class CPlayer
{

public:
	DWORD isValidPlayer; //0x0000 
	char pad_0x0004[0x4]; //0x0004
	__int32 playerID; //0x0008 
	CName* ptrCname; //0x000C 
	char pad_0x0010[0x8]; //0x0010
	__int32 USGN_ID; //0x0018 
	char pad_0x001C[0x30]; //0x001C
	float Angle; //0x004C 
	char pad_0x0050[0x14]; //0x0050
	__int32 IdleTime; //0x0064 
	char pad_0x0068[0xCC]; //0x0068
	__int32 TeamID; //0x0134 
	char pad_0x0138[0xC]; //0x0138
	float X; //0x0144 
	float Y; //0x0148 
	float Rotation; //0x014C 
	float Rotation2; //0x0150 
	__int32 TileX; //0x0154 
	__int32 TileY; //0x0158 
	char pad_0x015C[0x8]; //0x015C
	__int32 curHP; //0x0164 
	__int32 maxHP; //0x0168 
	__int32 Armor; //0x016C 
	__int32 Money; //0x0170 
	char pad_0x0174[0x4]; //0x0174
	__int32 playerScore; //0x0178 
	__int32 playerDeaths; //0x017C 
	char pad_0x0180[0x28]; //0x0180
	CWeapon* ptrWeapon; //0x01A8 
	__int32 hasNightVision; //0x01AC 
	__int32 hasDefuser; //0x01B0 
	__int32 hasBomb; //0x01B4 
	char pad_0x01B8[0xC]; //0x01B8
	__int32 PrevWeaponID; //0x01C4 
	char pad_0x01C8[0x10]; //0x01C8
	__int32 isReloading; //0x01D8 
	char pad_0x01DC[0x10]; //0x01DC
	__int32 isPlantingAndDefusing; //0x01EC 
	char pad_0x01F0[0x8]; //0x01F0
	float Speed; //0x01F8 
	__int32 isMoving; //0x01FC 
	char pad_0x0200[0x10]; //0x0200
	__int32 MovementAngle; //0x0210 
	char pad_0x0214[0x8]; //0x0214
	__int32 MovmentX; //0x021C 
	__int32 MovmentY; //0x0220 
	char pad_0x0224[0x1C]; //0x0224
	__int32 sprayCD; //0x0240 
	char pad_0x0244[0x1FC]; //0x0244

}; //Size=0x0440


class CName
{
public:
	__int32 N00000AF1; //0x0000 
	__int32 N00000AF2; //0x0004 
	__int32 NicknameLen; //0x0008 max = 25
	wchar_t Nickname[25]; //0x000C 

}; //Size=0x0040

class CWeapon
{
public:
	DWORD N00000B4C; //0x0000 
	__int32 Get; //0x0004 
	char pad_0x0008[0x4]; //0x0008
	__int32 WeaponID; //0x000C 
	__int32 playerID; //0x0010 
	__int32 Ammo; //0x0014 
	__int32 AmmoIn; //0x0018 
	__int32 Mode; //0x001C 
	char pad_0x0020[0x20]; //0x0020

}; //Size=0x0040

CPlayer * GetPlayer(int iIndex) {
	//LocalPlayerPtr -> 006CC294
	//DWORD addr = 0x00663C04;
	//void* playerAddr = (void*)*(DWORD*)addr;
	_asm {
		push esi
		push ebx
		xor esi, esi
		mov eax, dword ptr [0x006C1990]
		mov eax, [eax]
		push eax
		mov eax, [eax]
		call dword ptr [eax+140] // eax+8C
		add esp, 04
		mov ebx, eax

		Looop:

			mov eax, ebx
			push eax
			mov eax, [eax]
			call dword ptr [eax+48] // eax+30
			add esp, 04
			cmp eax, 0
			je nothing
			mov eax, ebx
			push 0x6c2e18
			push eax
			mov eax, [eax]
			call dword ptr[eax + 52] // eax+34
			add esp, 8
			cmp eax, 0x00679C40
			je nothing
			mov esi, iIndex
			cmp [eax+8], esi
			je Done
			jne Looop

		nothing:

			xor eax, eax

		Done:

			pop ebx
			pop esi
	}
}

//==========================================================================================================================

char* GetDirectoryFile(char *filename)
{
	char my_documents[MAX_PATH];
